Repository: godsrighteousman/gelir_gider
Catalog: lib/l10n/app_*.arb
Languages: tr

# appSubtitle
source: Smart Expense Tracking App
tr: Akıllı Harcama Takip Uygulaması

# startButton
source: START
tr: BAŞLA

# bottomText
source: Reach your financial goals! 💪
tr: Finansal hedeflerinize ulaşın! 💪

source: Welcome!
tr: Hoş Geldiniz!

# setUsername
source: Set your username
tr: Kullanıcı adınızı belirleyin

source: Username
tr: Kullanıcı Adı

# usernameHint
source: Ex: john
tr: Kullanıcı adınızı girin

# usernameRequired
source: Username is required
tr: Kullanıcı adı gerekli

# usernameMinLength
source: Username must be at least 3 characters
tr: Kullanıcı adı en az 3 karakter olmalı

# usernameMaxLength
source: Username must be at most 20 characters
tr: Kullanıcı adı en fazla 20 karakter olmalı

source: Login
tr: Giriş Yap

# idInfo
source: After setting your username, a unique ID will be automatically assigned to you.
tr: Kullanıcı adınız belirlendikten sonra otomatik olarak size özel bir ID atanacaktır.

source: Expense Tracking App
tr: Harcama Takip Uygulaması

source: Home
tr: Ana Sayfa

source: Set Salary Day
tr: Maaş Günü Ayarla

source: Days until salary
tr: Maaş gününe kalan

source: Click to set
tr: Tıkla ve ayarla

source: days
tr: gün

source: Monthly Budget
tr: Aylık Bütçe

source: Total
tr: Toplam

source: Remaining
tr: Kalan

# noBudgetSet
source: No budget set yet
tr: Henüz bütçe girilmedi

source: Total Expenses
tr: Toplam Harcama

source: Expense Count
tr: Harcama Sayısı

source: Category Count
tr: Kategori Sayısı

source: Today
tr: Bugün

source: This Week
tr: Bu Hafta

source: This Month
tr: Bu Ay

source: Category Distribution
tr: Kategori Dağılımı

source: All
tr: Tümü

source: Date
tr: Tarih

source: Amount
tr: Tutar (₺)

source: Category
tr: Kategori

source: Expense History
tr: Harcama Geçmişi

source: expenses
tr: harcama

source: No expenses yet
tr: Henüz harcama yok

# clickToAddFirst
source: Click the + button to add your first expense
tr: İlk harcamanızı eklemek için + butonuna tıklayın

source: Add Expense
tr: Harcama Ekle

source: Delete Expense
tr: Harcamayı Sil

# expenseDeleteConfirm
source: expense will be deleted. Are you sure?
tr: harcaması silinecek. Emin misin?

source: Cancel
tr: İptal

source: Delete
tr: Sil

source: Logout
tr: Çıkış Yap

# logoutConfirm
source: Are you sure you want to logout from your account?
tr: Hesabınızdan çıkış yapmak istediğinizden emin misiniz?

# salaryDayQuestion
source: On which day of the month do you receive your salary?
tr: Ayın hangi günü maaş alıyorsunuz?

# dayLabel
source: Day (1-31)
tr: Gün (1-31)

# dayHint
source: Ex: 15
tr: Örn: 15

source: Save
tr: Kaydet

# budgetQuestion
source: Enter your monthly total budget
tr: Aylık toplam bütçenizi girin

# budgetLabel
source: Budget (₺)
tr: Bütçe (₺)

# budgetHint
source: Ex: 5000.00
tr: Örn: 5000.00

source: My Friends
tr: Arkadaşlarım

source: Total Friends
tr: Toplam Arkadaş

source: Total Credit
tr: Toplam Alacak

source: Total Debt
tr: Toplam Borç

source: shared expenses
tr: ortak alışveriş

source: Delete Friend
tr: Arkadaşı Sil

# friendDeleteConfirm
source: will be removed from friends list. This action cannot be undone. Are you sure?
tr: arkadaş listenden silinecek. Bu işlem geri alınamaz. Emin misin?

# noFriendsYet
source: No friends added yet
tr: Henüz arkadaş eklenmemiş

# addFriendsToTrack
source: Add your friends to track shared expenses
tr: Arkadaşlarınızı ekleyerek ortak harcamalarınızı takip edin

source: Add First Friend
tr: İlk Arkadaşını Ekle

source: Add Friend
tr: Arkadaş Ekle

source: Your ID:
tr: Sizin ID'niz:

source: Friend ID
tr: Arkadaş ID

# friendIdHint
source: Ex: john
tr: Örn: ahmet

# searchingUser
source: Searching for user...
tr: Kullanıcı aranıyor...

source: User found!
tr: Kullanıcı bulundu!

source: User not found
tr: Kullanıcı bulunamadı

source: Add
tr: Ekle

source: Add Shared Expense
tr: Ortak Alışveriş Ekle

# amountLabel
source: Amount (₺)
tr: Tutar

# amountHint
source: Ex: 250.00
tr: Örn: 250.00

source: Description
tr: Açıklama

# descriptionHint
source: Ex: Grocery shopping
tr: Örn: Market alışverişi

source: Select debt type:
tr: Borç türünü seçin:

source: Full amount
tr: Hepsini yansıt

# fullAmountDesc
source: Full amount is reflected as debt to the other party
tr: Tüm tutar karşı tarafa borç olarak yansır

source: Half amount
tr: Yarısını yansıt

# halfAmountDesc
source: Half of the amount is reflected as debt to the other party
tr: Tutarın yarısı karşı tarafa borç olarak yansır

source: Add Payment
tr: Ödeme Ekle

source: Payment Amount (₺)
tr: Ödeme Tutarı (₺)

# paymentHint
source: Ex: 100.00
tr: Örn: 100.00

source: Note (optional)
tr: Not (opsiyonel)

# noteHint
source: Ex: Cash payment
tr: Örn: Nakit ödeme

source: Net Balance
tr: Net Durum

source: owes you
tr: size borçlu

source: You owe
tr: Siz {friendName}'e borçlusunuz

# accountsEqual
source: Accounts are equal
tr: Hesap eşit

# totalShopping
source: Total Expenses
tr: Toplam Alışveriş

# sharedExpense
source: Shared expenses
tr: Ortak harcama

source: Shopping History
tr: Alışveriş Geçmişi

# noSharedExpenses
source: No shared expenses yet
tr: Henüz ortak alışveriş yok

# addFirstShared
source: Add your first shared expense with
tr: ile ilk ortak alışverişinizi ekleyin

source: Add First Expense
tr: İlk Alışverişi Ekle

source: Add New Expense
tr: Yeni Harcama Ekle

source: Enter amount
tr: Tutar girin

source: Enter valid amount
tr: Geçerli tutar girin

source: Change
tr: Değiştir

# addNoteAbout
source: Add note about expense...
tr: Harcama hakkında not ekleyin...

source: Skip
tr: Atla

source: Next
tr: İleri

source: Start
tr: Başla

source: Select Language
tr: Dil Seç

source: Turkish
tr: Türkçe

source: Food
tr: Yemek

source: Transportation
tr: Ulaşım

source: Clothing
tr: Giyim

source: Entertainment
tr: Eğlence

source: Bills
tr: Fatura

source: Other
tr: Diğer

source: Refresh
tr: Yenile

# nightModeOn
source: Night mode enabled
tr: Gece modu açıldı

# dayModeOn
source: Day mode enabled
tr: Gündüz modu açıldı

# setSalaryDayText
source: Set salary day
tr: Maaş gününü ayarla

# clickToSetText
source: Click to set
tr: Tıkla ve ayarla

# daysText
source: days
tr: gün

# noBudgetSetText
source: No budget set yet
tr: Henüz bütçe girilmedi

source: Friends list refreshed
tr: Arkadaşlar listesi yenilendi

source: No friends added yet
tr: Henüz arkadaş eklenmemiş

# youOweText
source: You owe
tr: Siz

source: Me
tr: Ben

# sharedExpensesText
source: Shared expenses
tr: Ortak harcamalar
